In [6]:
%reload_ext sql
connect = "mysql://root:@localhost/asteroids"
%sql $connect

In [7]:
%%sql
select * from registry limit 10;

 * mysql://root:***@localhost/asteroids
10 rows affected.

[('C-a1416-m', 'Carboneous', 'UK', datetime.date(2008, 12, 23)),
 ('C-a32-j', 'Carboneous', 'US', datetime.date(1991, 4, 28)),
 ('C-a3598-j', 'Carboneous', 'UK', datetime.date(2020, 7, 26)),
 ('C-a3740-n', 'Carboneous', 'CHINA', datetime.date(1993, 2, 6)),
 ('C-a3981-j', 'Carboneous', 'CHINA', datetime.date(2007, 5, 20)),
 ('C-a4266-p', 'Carboneous', 'RUSSIA', datetime.date(1995, 11, 1)),
 ('C-a4790-n', 'Carboneous', 'US', datetime.date(1994, 2, 21)),
 ('C-a4883-p', 'Carboneous', 'US', datetime.date(1999, 2, 7)),
 ('C-a914-m', 'Carboneous', 'US', datetime.date(2011, 1, 9)),
 ('C-b1962-l', 'Carboneous', 'CHINA', datetime.date(2002, 5, 24))]

In [9]:
%%sql
show tables;

 * mysql://root:***@localhost/asteroids
9 rows affected.

[('composition_common',),
 ('composition_precious',),
 ('composition_simple',),
 ('composition_strategic',),
 ('orbit',),
 ('registry',),
 ('spatialCoord',),
 ('specifications',),
 ('surface_feature',)]

In [12]:
%%sql
select * from orbit limit 5;

 * mysql://root:***@localhost/asteroids
5 rows affected.

[('C-a1416-m', Decimal('1.650'), Decimal('1.476'), Decimal('0.446'), Decimal('602.234'), Decimal('1.56')),
 ('C-a32-j', Decimal('1.845'), Decimal('1.701'), Decimal('0.388'), Decimal('673.593'), Decimal('1.77')),
 ('C-a3598-j', Decimal('1.894'), Decimal('1.710'), Decimal('0.429'), Decimal('691.237'), Decimal('1.80')),
 ('C-a3740-n', Decimal('1.535'), Decimal('1.381'), Decimal('0.436'), Decimal('560.176'), Decimal('1.46')),
 ('C-a3981-j', Decimal('1.691'), Decimal('1.489'), Decimal('0.474'), Decimal('617.369'), Decimal('1.59'))]